AT-2/summary500.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Thread Group:1 Main,500,39592,411,133944,"39962,39","14,400%","3,66397","49,40","1,13","13805,7"
Thread Group:2 end-of-the-work,500,17101,74,139625,"18291,09","1,400%","2,67258","48,59","0,53","18616,3"
Thread Group:3 epam-sytems,500,16310,56,145529,"21306,68","1,800%","2,59106","40,64","0,50","16062,9"
Thread Group:4 hello-world,500,15209,33,145529,"20809,44","1,600%","2,59588","54,55","0,50","21516,9"
Thread Group:5 author/siarheituzhyk,500,11782,26,145529,"15761,34","1,000%","2,54286","38,69","0,00","15579,9"
Thread Group:6 2016/11/22/,500,9981,25,127723,"13603,97","0,400%","2,60423","33,86","0,48","13313,3"
Thread Group:7 category/epam/,500,8399,27,127228,"10830,59","0,200%","2,33373","30,65","0,44","13449,3"
Thread Group:8 hello-world/#comment-1,500,8700,30,139548,"11039,39","0,200%","2,46485","52,44","0,48","21785,5"
Thread Group:9 epam-sytems,500,6795,28,59209,"6248,30","0,000%","2,80169","44,63","0,55","16310,9"
Thread Group:10 Main,500,5771,23,69631,"5695,42","0,000%","2,90416","43,90","0,50","15477,9"
TOTAL,5000,13964,23,145529,"21057,56","2,100%","22,07009","357,60","4,04","16591,9"