AT-2/summary800.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Thread Group:1 Main,800,58012,494,185974,"48799,70","24,375%","4,28197","52,34","1,22","12516,9"
Thread Group:2 end-of-the-work,800,29390,64,129088,"31704,91","10,875%","2,55249","42,53","0,46","17063,5"
Thread Group:3 epam-sytems,800,28838,75,162430,"36493,82","12,875%","2,55083","36,16","0,44","14517,8"
Thread Group:4 hello-world,800,26648,153,162431,"34284,05","11,750%","2,52988","48,29","0,44","19544,9"
Thread Group:5 author/siarheituzhyk,800,20651,90,162428,"29200,78","7,000%","2,53210","36,48","0,00","14752,1"
Thread Group:6 2016/11/22/,800,16241,116,162431,"24339,41","4,000%","2,56720","32,39","0,45","12920,9"
Thread Group:7 category/epam/,800,12857,95,129088,"17419,61","2,250%","2,77686","35,86","0,51","13223,5"
Thread Group:8 hello-world/#comment-1,800,12684,86,127307,"15868,08","1,500%","3,10429","65,28","0,60","21532,1"
Thread Group:9 epam-sytems,800,11976,58,203558,"17536,95","1,625%","3,21792","50,55","0,62","16085,3"
Thread Group:10 Main,800,9745,44,127320,"10954,82","0,500%","3,38298","50,92","0,59","15412,6"
TOTAL,8000,22704,44,203558,"31925,82","7,675%","25,15352","387,05","4,34","15757,0"